=============================
Simple comment
=============================
{# Comment #}
---

(source_file
  (comment))

=============================
Multiline comment
:error
=============================
{#
Error
#}
---



=============================
Multiple comments
=============================
{# 1 #}{# 2 #}{# 3 #}
---

(source_file
  (comment)
  (comment)
  (comment))

=============================
Comment with text
=============================

WOW BOB WOW

{# Comment #}

MyCoolText

---

(source_file
  (text)
  (comment)
  (text))

=============================
Comment with #
=============================

{###}

{# # #}

{# ### #}

---

(source_file
  (text)
  (comment)
  (text)
  (comment)
  (text)
  (comment)
  (text))

=============================
Comment with #}
=============================

{##}#}

---

(source_file
  (text)
  (comment)
  (text))

=============================
Nested comments
=============================
{#{##}#}
---

(source_file
  (comment)
  (text))

=============================
Comment and { text
=============================
{
{##}
---

(source_file
  (text)
  (comment))
