=============================
Simple comment
=============================
{# Comment #}
---

(source_file
  (comment_block))

=============================
Multiline comment
=============================
{#
Wow
#}
---

(source_file
  (comment_block))

=============================
Multiple comments
=============================
{# 1 #}{# 2 #}{# 3 #}
---

(source_file
  (comment_block)
  (comment_block)
  (comment_block))

=============================
Comment with text
=============================

{# Comment #}

MyCoolText

{#
WOW BOB WOW
#}{##}

---

(source_file
  (text_block)
  (comment_block)
  (text_block)
  (comment_block)
  (comment_block)
  (text_block))

=============================
Comment with #
=============================

{###}

{# # #}

{# ### #}

{#
###
#}

---

(source_file
  (text_block)
  (comment_block)
  (text_block)
  (comment_block)
  (text_block)
  (comment_block)
  (text_block)
  (comment_block)
  (text_block))

=============================
Comment with #}
=============================

{##}#}

---

(source_file
  (text_block)
  (comment_block)
  (text_block))

=============================
Nested comments
=============================
{#{##}#}
---

(source_file
  (comment_block)
  (text_block))

=============================
Comment and { text
=============================
{
{##}
---

(source_file
  (text_block)
  (comment_block))
