=============================
Simple comment
=============================
{# Comment #}
---

(source_file
  (comment_tag
    (comment)))

=============================
Multiple comments
=============================
{# 1 #}{# 2 #}{# 3 #}
---

(source_file
  (comment_tag
    (comment))
  (comment_tag
    (comment))
  (comment_tag
    (comment)))

=============================
Space between comments
=============================
{# 1 #} {# 2 #}
---

(source_file
  (comment_tag
    (comment))
  (text)
  (comment_tag
    (comment)))

=============================
Newline between comments
=============================
{# 1 #}

{# 2 #}
---

(source_file
  (comment_tag
    (comment))
  (text)
  (comment_tag
    (comment)))

=============================
Comment with text
=============================

WOW BOB WOW

{# Comment #}

MyCoolText

---

(source_file
  (text)
  (comment_tag
    (comment))
  (text))

=============================
Comment with #
=============================
{###}
{# # #}
{# ### #}
---

(source_file
  (comment_tag
    (comment))
  (text)
  (comment_tag
    (comment))
  (text)
  (comment_tag
    (comment)))

=============================
Trail spaces
=============================
{##} 
{##}
---

(source_file
  (comment_tag)
  (text)
  (comment_tag))

=============================
Comment with #}
=============================
{##}#}
---

(source_file
  (comment_tag)
  (text))

=============================
#} before comment
=============================
#}{##}
---

(source_file
  (text)
  (comment_tag))

=============================
Nested comments
=============================
{#{##}#}
---

(source_file
  (comment_tag
    (comment))
  (text))

=============================
Comment and { text
=============================
{
{##}
---

(source_file
  (text)
  (comment_tag))
