===
Comments
===
{# comment 1 #}{# comment 2 #}
{#comment#}
---

(source_file
  (comment_tag
    (comment))
  (comment_tag
    (comment))
  (text)
  (comment_tag
    (comment)))

===
Comment with text
===

WOW BOB WOW {# Comment #}MyCoolText

---

(source_file
  (text)
  (comment_tag
    (comment))
  (text))

===
Comment with #
===
{# ### #}
---

(source_file
  (comment_tag
    (comment)))

===
Trail spaces
===
{##} 
{##}
---

(source_file
  (comment_tag)
  (text)
  (comment_tag))

===
Comment with #}
===
{##}#}
---

(source_file
  (comment_tag)
  (text))

===
#} before comment
===
#}{##}
---

(source_file
  (text)
  (comment_tag))

===
Nested comments
===
{#{##}#}
---

(source_file
  (comment_tag
    (comment))
  (text))

===
Comment and { text
===
{ {##}
---

(source_file
  (text)
  (comment_tag))

===
Multiline comment
:error
===
{#
comment
#}
---


