=============================
Render with text
=============================

Hello {{ name }}!

---

(source_file
  (text)
  (render
    (identifier))
  (text))

=============================
Multiline render
:error
=============================
{{""
}}
---



=============================
Multiple renders
=============================
{{a}}{{a}}{{a}}
---

(source_file
  (render
    (identifier))
  (render
    (identifier))
  (render
    (identifier)))

=============================
Nested renders
:error
=============================

{{ {{a}} }}

---



=============================
Identifier
=============================

{{ name }}
{{ nam_e1 }}
{{ _nam_e1 }}
{{ @name }}
{{ @na_me1 }}

---

(source_file
  (text)
  (render
    (identifier))
  (text)
  (render
    (identifier))
  (text)
  (render
    (identifier))
  (text)
  (render
    (identifier))
  (text)
  (render
    (identifier))
  (text))

=============================
Invalid identifier
:error
=============================

{{ @_iaminvalid }}

---



=============================
Function call
=============================

{{ foo() }}
{{ @foo() }}
{{ foo(x) }}
{{ foo(x, y) }}
{{ foo(bar()) }}

---

(source_file
  (text)
  (render
    (call_expression
      function: (identifier)
      arguments: (argument_list)))
  (text)
  (render
    (call_expression
      function: (identifier)
      arguments: (argument_list)))
  (text)
  (render
    (call_expression
      function: (identifier)
      arguments: (argument_list
        (identifier))))
  (text)
  (render
    (call_expression
      function: (identifier)
      arguments: (argument_list
        (identifier)
        (identifier))))
  (text)
  (render
    (call_expression
      function: (identifier)
      arguments: (argument_list
        (call_expression
          function: (identifier)
          arguments: (argument_list)))))
  (text))

=============================
Invalid function call
:error
=============================

{{ foo( }}

---



=============================
Unary expression
=============================

{{ ! flag }}
{{ !true }}
{{ !"str" }}
{{ not true }}
{{ not "srr" }}
{{ not value }}

---

(source_file
  (text)
  (render
    (unary_expression
      (identifier)))
  (text)
  (render
    (unary_expression
      (boolean_literal)))
  (text)
  (render
    (unary_expression
      (string_literal)))
  (text)
  (render
    (unary_expression
      (boolean_literal)))
  (text)
  (render
    (unary_expression
      (string_literal)))
  (text)
  (render
    (unary_expression
      (identifier)))
  (text))

=============================
Binary expression
=============================

{{ a == b }}
{{ a != b }}
{{ a < b }}
{{ a > b }}
{{ a >= b }}
{{ a <= b }}
{{ a ~ b }}
{{ a or b }}
{{ a and b }}
{{ a is b }}
{{ a is not b }}
{{   a is   not  b }}

---

(source_file
  (text)
  (render
    (binary_expression
      left: (identifier)
      right: (identifier)))
  (text)
  (render
    (binary_expression
      left: (identifier)
      right: (identifier)))
  (text)
  (render
    (binary_expression
      left: (identifier)
      right: (identifier)))
  (text)
  (render
    (binary_expression
      left: (identifier)
      right: (identifier)))
  (text)
  (render
    (binary_expression
      left: (identifier)
      right: (identifier)))
  (text)
  (render
    (binary_expression
      left: (identifier)
      right: (identifier)))
  (text)
  (render
    (binary_expression
      left: (identifier)
      right: (identifier)))
  (text)
  (render
    (binary_expression
      left: (identifier)
      right: (identifier)))
  (text)
  (render
    (binary_expression
      left: (identifier)
      right: (identifier)))
  (text)
  (render
    (binary_expression
      left: (identifier)
      right: (identifier)))
  (text)
  (render
    (binary_expression
      left: (identifier)
      right: (identifier)))
  (text)
  (render
    (binary_expression
      left: (identifier)
      right: (identifier)))
  (text))

=============================
Nested unary expressions
=============================

{{ not not true }}
{{ not !true }}
{{ !!true }}
{{ false is not not true }}
{{ false is not ! true }}
{{ false is not a < false }}
{{ (false is not true) is not a }}

---

(source_file
  (text)
  (render
    (unary_expression
      (unary_expression
        (boolean_literal))))
  (text)
  (render
    (unary_expression
      (unary_expression
        (boolean_literal))))
  (text)
  (render
    (unary_expression
      (unary_expression
        (boolean_literal))))
  (text)
  (render
    (binary_expression
      (boolean_literal)
      (unary_expression
        (boolean_literal))))
  (text)
  (render
    (binary_expression
      (boolean_literal)
      (unary_expression
        (boolean_literal))))
  (text)
  (render
    (binary_expression
      (binary_expression
        (boolean_literal)
        (identifier))
      (boolean_literal)))
  (text)
  (render
    (binary_expression
      (parenthesized_expression
        (binary_expression
          (boolean_literal)
          (boolean_literal)))
      (identifier)))
  (text))

=============================
Nested binary expressions
=============================

{{ a or b and c or d and e }}
{{ not a and b or not c }}
{{ a == b and c != d or e > f }}
{{ x or y and z == w or v }}
{{ a and b or c and d or e }}

---

(source_file
  (text)
  (render
    (binary_expression
      (binary_expression
        (identifier)
        (binary_expression
          (identifier)
          (identifier)))
      (binary_expression
        (identifier)
        (identifier))))
  (text)
  (render
    (binary_expression
      (binary_expression
        (unary_expression
          (identifier))
        (identifier))
      (unary_expression
        (identifier))))
  (text)
  (render
    (binary_expression
      (binary_expression
        (binary_expression
          (identifier)
          (identifier))
        (binary_expression
          (identifier)
          (identifier)))
      (binary_expression
        (identifier)
        (identifier))))
  (text)
  (render
    (binary_expression
      (binary_expression
        (identifier)
        (binary_expression
          (identifier)
          (binary_expression
            (identifier)
            (identifier))))
      (identifier)))
  (text)
  (render
    (binary_expression
      (binary_expression
        (binary_expression
          (identifier)
          (identifier))
        (binary_expression
          (identifier)
          (identifier)))
      (identifier)))
  (text))

=============================
Parenthesized expression
=============================

{{ ("") }}
{{ (true) }}
{{ (name) }}
{{ a is (not b) }}

---

(source_file
  (text)
  (render
    (parenthesized_expression
      (string_literal)))
  (text)
  (render
    (parenthesized_expression
      (boolean_literal)))
  (text)
  (render
    (parenthesized_expression
      (identifier)))
  (text)
  (render
    (binary_expression
      (identifier)
      (parenthesized_expression
        (unary_expression
          (identifier)))))
  (text))
