===
Identifier
===
{{ name }}
{{ _nam_e1 }}
{{ @name }}
{{ @na_me1 }}
---

(source_file
  (display_tag
    (identifier))
  (text)
  (display_tag
    (identifier))
  (text)
  (display_tag
    (identifier))
  (text)
  (display_tag
    (identifier)))

===
Invalid identifier
:error
===
{{ @_iaminvalid }}
---



===
Function call
===
{{ foo() }}
{{ foo(x) }}
{{ foo(x, y) }}
{{ foo(bar()) }}
---

(source_file
  (display_tag
    (call_expression
      function: (identifier)
      arguments: (argument_list)))
  (text)
  (display_tag
    (call_expression
      function: (identifier)
      arguments: (argument_list
        (identifier))))
  (text)
  (display_tag
    (call_expression
      function: (identifier)
      arguments: (argument_list
        (identifier)
        (identifier))))
  (text)
  (display_tag
    (call_expression
      function: (identifier)
      arguments: (argument_list
        (call_expression
          function: (identifier)
          arguments: (argument_list))))))

===
Unary expression
===
{{ !flag }}
{{ !true }}
{{ !"str" }}
---

(source_file
  (display_tag
    (unary_expression
      (identifier)))
  (text)
  (display_tag
    (unary_expression
      (boolean_literal)))
  (text)
  (display_tag
    (unary_expression
      (string_literal))))

===
Binary expression
===
{{ a == b }}
{{ a != b }}
{{ a ~ b }}
{{ a or b }}
{{ a and b }}
---

(source_file
  (display_tag
    (binary_expression
      left: (identifier)
      right: (identifier)))
  (text)
  (display_tag
    (binary_expression
      left: (identifier)
      right: (identifier)))
  (text)
  (display_tag
    (binary_expression
      left: (identifier)
      right: (identifier)))
  (text)
  (display_tag
    (binary_expression
      left: (identifier)
      right: (identifier)))
  (text)
  (display_tag
    (binary_expression
      left: (identifier)
      right: (identifier))))

===
Nested unary expressions
===
{{ !!true }}
---

(source_file
  (display_tag
    (unary_expression
      (unary_expression
        (boolean_literal)))))

===
Parenthesized expression
===
{{ (a) }}
---

(source_file
  (display_tag
    (parenthesized_expression
      (identifier))))
