===
Boolean literal
===

{{ true }}
{{ false }}

---

(source_file
  (text)
  (display_tag
    (boolean_literal))
  (text)
  (display_tag
    (boolean_literal))
  (text))

===
String literal
===

{{ "simple" }}

---

(source_file
  (text)
  (display_tag
    (string_literal))
  (text))

===
String literal with special chars
===

{{ "'" }}
{{ "{" }}
{{ "{{" }}
{{ "}}" }}
{{ "{#" }}
{{ "#}" }}
{{ "{%" }}
{{ "%}" }}
{{ "(" }}
{{ ")" }}

---

(source_file
  (text)
  (display_tag
    (string_literal))
  (text)
  (display_tag
    (string_literal))
  (text)
  (display_tag
    (string_literal))
  (text)
  (display_tag
    (string_literal))
  (text)
  (display_tag
    (string_literal))
  (text)
  (display_tag
    (string_literal))
  (text)
  (display_tag
    (string_literal))
  (text)
  (display_tag
    (string_literal))
  (text)
  (display_tag
    (string_literal))
  (text)
  (display_tag
    (string_literal))
  (text))

===
Escaped string literal
===

{{ "\n" }}
{{ "\r" }}
{{ "\"" }}
{{ "\u03A9" }}
{{ "\U0001F600" }}
{{ "\x7F" }}
{{ "\  t" }}

---

(source_file
  (text)
  (display_tag
    (string_literal
      (escape_sequence)))
  (text)
  (display_tag
    (string_literal
      (escape_sequence)))
  (text)
  (display_tag
    (string_literal
      (escape_sequence)))
  (text)
  (display_tag
    (string_literal
      (escape_sequence)))
  (text)
  (display_tag
    (string_literal
      (escape_sequence)))
  (text)
  (display_tag
    (string_literal
      (escape_sequence)))
  (text)
  (display_tag
    (string_literal
      (escape_sequence)))
  (text))

===
Invalid multiline string literal
:error
===

{{ "
" }}

---



===
Invalid string literal with quote
:error
===
{{ " " " }}
---


