===
Boolean literal
===
{{ true }}
{{ false }}
---

(source_file
  (render
    (boolean_literal))
  (text)
  (render
    (boolean_literal)))

===
Simple string literal
===
{{ "based" }}
{{ "" }}
{{ "    	" }}
---

(source_file
  (render
    (string_literal))
  (text)
  (render
    (string_literal))
  (text)
  (render
    (string_literal)))

===
String literal with special chars
===
{{ "'" }}
{{ "{" }}
{{ "{{" }}
{{ "}}" }}
{{ "#}" }}
{{ "##}" }}
{{ "{#" }}
{{ "{%" }}
{{ "%}" }}
---

(source_file
  (render
    (string_literal))
  (text)
  (render
    (string_literal))
  (text)
  (render
    (string_literal))
  (text)
  (render
    (string_literal))
  (text)
  (render
    (string_literal))
  (text)
  (render
    (string_literal))
  (text)
  (render
    (string_literal))
  (text)
  (render
    (string_literal))
  (text)
  (render
    (string_literal)))

===
Escaped string literal
===
{{ "\n" }}
{{ "\r" }}
{{ "\"" }}
{{ "\u03A9" }}
{{ "\U0001F600" }}
{{ "\x7F" }}
{{ "\  t" }}
---

(source_file
  (render
    (string_literal
      (escape_sequence)))
  (text)
  (render
    (string_literal
      (escape_sequence)))
  (text)
  (render
    (string_literal
      (escape_sequence)))
  (text)
  (render
    (string_literal
      (escape_sequence)))
  (text)
  (render
    (string_literal
      (escape_sequence)))
  (text)
  (render
    (string_literal
      (escape_sequence)))
  (text)
  (render
    (string_literal
      (escape_sequence))))

===
Invalid multiline string literal
:error
===

{{ "
" }}

---



===
Invalid string literal
:error
===
{{ " " " }}
---


