=============================
Simple switch
=============================
{% switch key %}{% end %}
---

(source_file
  (switch_statement
    value: (identifier)))

=============================
Switch with one case
=============================
{%switch key%}{%case a%}{%end%}
---

(source_file
  (switch_statement
    value: (identifier)
    value: (identifier)))

=============================
Switch with text
=============================

{% switch key %}
{% case a %}
Text
{% case b %}
Text
{% end %}

---

(source_file
  (text)
  (switch_statement
    value: (identifier)
    value: (identifier)
    body: (block
      (text))
    value: (identifier)
    body: (block
      (text)))
  (text))

=============================
Nested switches
=============================

{% switch key %}
{% case a %}
  {% switch key %}
  {% case a %}
  Text
  {% end %}
{% end %}

---

(source_file
  (text)
  (switch_statement
    value: (identifier)
    value: (identifier)
    body: (block
      (text)
      (switch_statement
        value: (identifier)
        value: (identifier)
        body: (block
          (text)))
      (text)))
  (text))

=============================
Switch with if
=============================

{% switch key %}
{% case a %}
  {% if b %}
  {% end %}
{% end %}

---

(source_file
  (text)
  (switch_statement
    value: (identifier)
    value: (identifier)
    body: (block
      (text)
      (if_statement
        condition: (identifier)
        consequence: (block
          (text)))
      (text)))
  (text))

=============================
Switch with comment
=============================

{% switch key %}
{# A #}
{% case a %}
{% end %}

---

(source_file
  (text)
  (switch_statement
    value: (identifier)
    body: (comment)
    value: (identifier)
    body: (block
      (text)))
  (text))

=============================
Invalid switch with text
:error
=============================

{% switch key %}
YOU SHOULDNT PUT TEXT HERE
{% case a %}

{% end %}

---


