=============================
Simple switch
=============================
{% switch key %}{% end %}
---

(source_file
  (switch_statement
    value: (identifier)))

=============================
Switch with one case
=============================
{%switch key%}{%case a%}{%end%}
---

(source_file
  (switch_statement
    value: (identifier)
    cases: (case_clause
      value: (expression_list
        (identifier)))))

=============================
Switch with few expressions in case 
=============================
{%switch key%}{%case a, b%}{%end%}
---

(source_file
  (switch_statement
    value: (identifier)
    cases: (case_clause
      value: (expression_list
        (identifier)
        (identifier)))))


=============================
Switch with text
=============================

{% switch key %}
{% case a %}
Text
{% case b %}
Text
{% end %}

---

(source_file
  (text)
  (switch_statement
    value: (identifier)
    cases: (case_clause
      value: (expression_list
        (identifier))
      body: (block
        (text)))
    cases: (case_clause
      value: (expression_list
        (identifier))
      body: (block
        (text))))
  (text))

=============================
Nested switches
=============================

{% switch key %}
{% case a %}
  {% switch key %}
  {% case a %}
  Text
  {% end %}
{% end %}

---

(source_file
  (text)
  (switch_statement
    value: (identifier)
    cases: (case_clause
      value: (expression_list
        (identifier))
      body: (block
        (text)
        (switch_statement
          value: (identifier)
          cases: (case_clause
            value: (expression_list
              (identifier))
            body: (block
              (text))))
        (text))))
  (text))

=============================
Switch with if
=============================

{% switch key %}
{% case a %}
  {% if b %}
  {% end %}
{% end %}

---

(source_file
  (text)
  (switch_statement
    value: (identifier)
    cases: (case_clause
      value: (expression_list
        (identifier))
      body: (block
        (text)
        (if_statement
          condition: (identifier)
          consequence: (block
            (text)))
        (text))))
  (text))

=============================
Switch with comment
:error
=============================

{% switch key %}
{# A #}
{% case a %}
{% end %}

---



=============================
Invalid switch with text
:error
=============================

{% switch key %}
YOU SHOULDNT PUT TEXT HERE
{% case a %}

{% end %}

---


