=============================
Simple switch
=============================
{% switch key %}{% end %}
---

(source_file
  (switch_tag
    (identifier))
  (end_tag))

=============================
Switch with one case
=============================
{%switch key%}{%case a%}{%end%}
---

(source_file
  (switch_tag
    (identifier))
  (case_tag
    (expression_list
      (identifier)))
  (end_tag))

=============================
Switch with few expressions in case
=============================
{%switch key%}{%case a, b%}{%end%}
---

(source_file
  (switch_tag
    (identifier))
  (case_tag
    (expression_list
      (identifier)
      (identifier)))
  (end_tag))

=============================
Switch with text
=============================

{% switch key %}
{% case a %}
Text
{% case b %}
Text
{% end %}

---

(source_file
  (text)
  (switch_tag
    (identifier))
  (text)
  (case_tag
    (expression_list
      (identifier)))
  (text)
  (case_tag
    (expression_list
      (identifier)))
  (text)
  (end_tag)
  (text))

=============================
Nested switches
=============================

{% switch key %}
{% case a %}
  {% switch key %}
  {% case a %}
  Text
  {% end %}
{% end %}

---

(source_file
  (text)
  (switch_tag
    (identifier))
  (text)
  (case_tag
    (expression_list
      (identifier)))
  (text)
  (switch_tag
    (identifier))
  (text)
  (case_tag
    (expression_list
      (identifier)))
  (text)
  (end_tag)
  (text)
  (end_tag)
  (text))

=============================
Switch with if
=============================

{% switch key %}
{% case a %}
  {% if b %}
  {% end %}
{% end %}

---

(source_file
  (text)
  (switch_tag
    (identifier))
  (text)
  (case_tag
    (expression_list
      (identifier)))
  (text)
  (if_tag
    (identifier))
  (text)
  (end_tag)
  (text)
  (end_tag)
  (text))

=============================
Switch with comment
=============================

{% switch key %}
{# A #}
{% case a %}
{% end %}

---

(source_file
  (text)
  (switch_tag
    (identifier))
  (text)
  (comment)
  (text)
  (case_tag
    (expression_list
      (identifier)))
  (text)
  (end_tag)
  (text))

=============================
Invalid switch with text
=============================

{% switch key %}
YOU SHOULDNT PUT TEXT HERE
{% case a %}

{% end %}

---

(source_file
  (text)
  (switch_tag
    (identifier))
  (text)
  (case_tag
    (expression_list
      (identifier)))
  (text)
  (end_tag)
  (text))
