=============================
Simple switch
=============================
{% switch key %}{% end %}
---

(source_file
  (switch_block
    value: (identifier)))

=============================
Switch with one case
=============================
{%switch key%}{%case a%}{%end%}
---

(source_file
  (switch_block
    value: (identifier)
    value: (identifier)))

=============================
Switch with text
=============================

{% switch key %}
{% case a %}
Text
{% case b %}
Text
{% end %}

---

(source_file
  (text_block)
  (switch_block
    value: (identifier)
    value: (identifier)
    body: (text_block)
    value: (identifier)
    body: (text_block))
  (text_block))

=============================
Nested switches
=============================

{% switch key %}
{% case a %}
  {% switch key %}
  {% case a %}
  Text
  {% end %}
{% end %}

---

(source_file
  (text_block)
  (switch_block
    value: (identifier)
    value: (identifier)
    body: (text_block)
    body: (switch_block
      value: (identifier)
      value: (identifier)
      body: (text_block))
    body: (text_block))
  (text_block))

=============================
Switch with if
=============================

{% switch key %}
{% case a %}
  {% if b %}
  {% end %}
{% end %}

---

(source_file
  (text_block)
  (switch_block
    value: (identifier)
    value: (identifier)
    body: (text_block)
    body: (if_block
      condition: (identifier)
      consequence: (text_block))
    body: (text_block))
  (text_block))

=============================
Switch with comment
=============================

{% switch key %}
{# A #}
{% case a %}
{% end %}

---

(source_file
  (text_block)
  (switch_block
    value: (identifier)
    body: (comment_block)
    value: (identifier)
    body: (text_block))
  (text_block))

=============================
Invalid switch with text
:error
=============================

{% switch key %}
YOU SHOULDNT PUT TEXT HERE
{% case a %}

{% end %}

---


